---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.#ctor(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ)
source: html/c378fc23-9446-fe68-32c2-67f81aa7d7be.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionNormal.#ctor Method

Constructs the vertex from a point and a normal vector.

## Syntax (C#)
```csharp
public VertexPositionNormal(
	XYZ position,
	XYZ normal
)
```

## Parameters
- **position** (`Autodesk.Revit.DB.XYZ`) - The vertex's position.
- **normal** (`Autodesk.Revit.DB.XYZ`) - The vertex's normal vector.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null